import xml.etree.ElementTree as ET
import json
import os

from gylmodules.medical_record_analysis.record_parse.admission_record_parse import parse_hpi, clean_dict
from gylmodules.medical_record_analysis.build_cda.build_cda import assembling_cda_record

"""
====================================================================================================
======================================== 住院病案首页解析 ============================================
====================================================================================================
"""


def parse_homepage_record(data):

    for key, value in data.items():
        data[key] = str(value)

    # 将 Python 对象转换为格式化的 JSON 字符串
    # formatted_json = json.dumps(patient_info, indent=4, ensure_ascii=False)
    # print(formatted_json)
    cda_data = assembling_cda_record(data, 4)
    return cda_data


# Press the green button in the gutter to run the script.
if __name__ == '__main__':

    data = {
        "TOTAL_ROWS": 1,
        "主页ID": 3,
        "住院医师": "叶全力",
        "住院次数": 3,
        "入院日期": "2024-01-23 02:21:00",
        "入院科别": "普外二科/心脏大血管外科",
        "入院途径": "门诊",
        "出生地点": "河南省邓州市穰东镇翟庄村翟庄",
        "出生日期": "1947-08-20",
        "出院日期": "2024-02-05",
        "出院科别": "普外二科/心脏大血管外科",
        "医疗付款方式": "城乡居民",
        "单位地址": " 无",
        "单位电话": "18637728409",
        "单位邮编": "473000",
        "国籍": "中国",
        "姓名": "闫瑞芬",
        "婚姻状况": "已婚",
        "实际住院天数": 13,
        "家庭邮政编码": 0,
        "工作单位": " 无",
        "年龄": "76岁",
        "性别": "女",
        "总费用": 25643.93,
        "户口地址": "河南省邓州市穰东镇翟庄村翟庄",
        "户口邮编": 0,
        "损伤中毒原因": 0,
        "损伤中毒疾病编码": 0,
        "死亡患者尸检标志": 0,
        "民族": "汉族",
        "现住址": "河南省邓州市穰东镇翟庄村翟庄",
        "电话号码": 0,
        "疾病编码": 0,
        "病人ID": 3390962,
        "病案号": 366051,
        "病理诊断": 0,
        "离院方式": "医嘱离院",
        "籍贯": 0,
        "编码员": 0,
        "职业": "农民",
        "联系人关系": "子",
        "联系人地址": "河南省邓州市穰东镇翟庄村翟庄",
        "联系人姓名": "唐筱",
        "联系人电话": "18637728409",
        "责任护士": "张耀方",
        "质控日期": 0,
        "身份证号": "412930194708202227",
        "转科科别": "麻醉重症监护病房(AICU),心脏大血管外科,",
        "过敏药物": 0,
        "邮编": 0,
        "门诊医师": "陶功达",
        "ABO血型": "A型",
        "RH血型": 0,
        "主任医师": "钱俊甫",
        "入院病房": "6",
        "出院31天内再住院标志": 0,
        "出院病房": "6",
        "实习医师": 0,
        "年龄月": 0,
        "新生儿入院体重": 0,
        "无过敏记录": "1",
        "病理号": 0,
        "科主任": "钱俊甫",
        "质控医师": "钱俊甫",
        "质控护士": "罗红",
        "进修医师": 0,
        "伍": 206.7,
        "叁": 1382.9,
        "壹": 709,
        "壹拾伍": 0,
        "壹拾叁": 3711.46,
        "壹拾壹": 33.64,
        "壹拾捌": 0,
        "壹拾柒": 0,
        "壹拾玖": 0,
        "壹拾肆": 441.6,
        "壹拾贰": 51,
        "壹拾陆": 1520,
        "拾叁点一": 984.24,
        "拾点一": 1146.2,
        "拾点二": 1062.5,
        "捌": 1783.7,
        "柒": 1327.3,
        "玖": 612.1,
        "玖点一": 151,
        "肆": 0,
        "贰": 4076.96,
        "贰拾": 0,
        "贰拾叁": 114.6,
        "贰拾壹": 223.6,
        "贰拾肆": 0,
        "贰拾贰": 863.23,
        "陆": 5242.2,
        "入院病情": 0,
        "门急诊诊断名称": "消化道穿孔",
        "门急诊诊断疾病编码": "K27.504"
    }

    homepage = parse_homepage_record(data)
    print(homepage)








