q_type = {
    '主诉': 1,
    '现病史': 2,
    '既往史': 3,
    '体格检查': 4,
    '辅助检查': 5,
    '初步诊断': 6,
}

tpl_type = {
    '通用': 1,
    '专病': 2,
    '专科': 3
}

tpl_type_detail = {
    '通用': 0,
    '胸痛': 1,
    '痴呆': 2
}


tpl_list = [
    {
        "id": 2,
        "title": '专病',
        "list": [
            {
                "id": 1,
                "title": "胸痛",
            },
            {
                "id": 2,
                "title": "痴呆",
            }
        ]
    }
]


ans_type = {
    '填空': 1,
    '单选': 2,
    '多选': 3,
    '单选择器': 4,
    '双选择器': 5
}





